{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 50], "input_dtype": "int32", "input_dim": 30000, "output_dim": 32, "init": "uniform", "input_length": 50, "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "dropout": 0.0}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1", "trainable": true, "nb_filter": 32, "filter_length": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1", "trainable": true, "stride": 2, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 32, "input_length": null, "output_dim": 100, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "tanh", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "output_dim": 7, "init": "glorot_uniform", "activation": "sigmoid", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 100}}], "keras_version": "1.2.2"}